*** Phrase VI: B06N010074 Complaint for low immediate removal torque :@MichaelChristel:#VALM:
:PROPERTIES:
:TLM:      146926
:END:
:LOGBOOK:
CLOCK: [2017-09-22 周五 13:36]--[2017-09-22 周五 13:41] =>  0:05
CLOCK: [2017-09-21 周四 09:44]--[2017-09-21 周四 09:49] =>  0:05
:END:
** DONE EL PC Love Lipgloss (P361)                     :@Crystal:#NewLaunch:ARCHIVE:
CLOSED: [2017-09-11 周一 09:00]
:PROPERTIES:
:TLM:      146928
:END:
- Note taken on [2017-08-18 周五 09:44] \\
  US also cycled some dimension for tool qualification on the exiting dwg.
CLOCK: [2017-08-18 周五 09:43]--[2017-08-18 周五 09:45] =>  0:02
CLOCK: [2017-08-15 周二 10:27]--[2017-08-15 周二 10:50] =>  0:23
- Note taken on [2017-08-09 周三 09:27] \\
  the 5.3mm applicator is approved per Beth
On site tool qualification TBD early week of [2017-06-26 周一]
** LM_3.5ml_Promo_Jar_Redesign                                      :#VALM:
- Note taken on [2017-08-29 周二 10:41] \\
  TLM: 129993
CLOCK: [2017-08-23 周三 10:17]--[2017-08-23 周三 10:29] =>  0:12
CLOCK: [2017-08-23 周三 09:54]--[2017-08-23 周三 10:01] =>  0:07
*** DONE [#B] Check the equivalence of LM 3.5ml drawing 
CLOSED: [2017-08-19 周六 10:31]
- CLOSING NOTE [2017-08-19 周六 10:31] \\
  Give suggestion to Kim that the redesigned thread can work
CLOCK: [2017-08-10 周四 16:47]--[2017-08-10 周四 16:58] =>  0:11
** DONE Neopack tube cap ribe change             :@PatriciaVandeCraen:#VALM:ARCHIVE:
CLOSED: [2017-09-11 周一 09:01]
:PROPERTIES:
:TLM:      146929
:END:
CLOCK: [2017-08-29 周二 14:22]--[2017-08-29 周二 14:30] =>  0:08
- Note taken on [2017-08-29 周二 14:20] \\
  Get Cap samples from Patricia
  She send to the address of lab
- Note taken on [2017-08-29 周二 10:49] \\
  TLM: 146929
** DONE [#B] Think about what supplier can make 20-415 oil spray pump :@MichaelChristel:
CLOSED: [2017-09-19 周二 13:44] SCHEDULED: <2017-09-15 周五>
:PROPERTIES:
:CATEGORY: Email
:END:
:LOGBOOK:
- CLOSING NOTE [2017-09-19 周二 13:44] \\
  send mail to Michael and ask him to reach out Hana
CLOCK: [2017-09-15 周五 14:44]--[2017-09-15 周五 15:05] =>  0:21
:END:
** Panboo
:LOGBOOK:
CLOCK: [2017-09-20 周三 13:31]--[2017-09-20 周三 13:59] =>  0:28
:END:
